Revit 2027 API
RoutingCriterionBase Methods
The RoutingCriterionBase type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Verify if two criteria are the same.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RoutingCriterionBase Class
Autodesk.Revit.DB Namespace